export const playoffStages = [
  {
    "key": "r32",
    "title": "1/16 фіналу"
  },
  {
    "key": "r16",
    "title": "1/8 фіналу"
  },
  {
    "key": "qf",
    "title": "Чвертьфінали"
  },
  {
    "key": "sf",
    "title": "Півфінали"
  },
  {
    "key": "final",
    "title": "Фінал"
  }
] as const;

export const stadiums = [
  {
    "id": "att-stadium",
    "country": "США",
    "region": "Техас",
    "city": "Арлінгтон / Даллас",
    "name": "AT&T Stadium",
    "capacity": 70122,
    "matches": [
      [
        "14 червня",
        "23:00",
        "Груповий етап",
        "Нідерланди",
        "Японія"
      ],
      [
        "17 червня",
        "23:00",
        "Груповий етап",
        "Англія",
        "Хорватія"
      ],
      [
        "22 червня",
        "20:00",
        "Груповий етап",
        "Аргентина",
        "Австрія"
      ],
      [
        "26 червня",
        "02:00",
        "Груповий етап",
        "Японія",
        "Швеція"
      ],
      [
        "28 червня",
        "05:00",
        "Груповий етап",
        "Йорданія",
        "Аргентина"
      ],
      [
        "30 червня",
        "20:00",
        "1/16 фіналу",
        "2E",
        "2I",
        "r32-10"
      ],
      [
        "3 липня",
        "21:00",
        "1/16 фіналу",
        "2D",
        "2G",
        "r32-14"
      ],
      [
        "6 липня",
        "22:00",
        "1/8 фіналу",
        "Переможець матчу 83",
        "Переможець матчу 84",
        "r16-3"
      ],
      [
        "14 липня",
        "22:00",
        "Півфінал",
        "Переможець матчу 97",
        "Переможець матчу 98",
        "sf-1"
      ]
    ],
    "imagePath": "/stadiums/AT&T Stadium.png",
    "coordinates": {
      "lat": 32.748138,
      "lng": -97.093231
    }
  },
  {
    "id": "mercedes-benz-stadium",
    "country": "США",
    "region": "Джорджія",
    "city": "Атланта",
    "name": "Mercedes-Benz Stadium",
    "capacity": 67382,
    "matches": [
      [
        "15 червня",
        "19:00",
        "Груповий етап",
        "Іспанія",
        "Кабо-Верде"
      ],
      [
        "18 червня",
        "19:00",
        "Груповий етап",
        "Чехія",
        "ПАР"
      ],
      [
        "21 червня",
        "19:00",
        "Груповий етап",
        "Іспанія",
        "Саудівська Аравія"
      ],
      [
        "25 червня",
        "01:00",
        "Груповий етап",
        "Марокко",
        "Гаїті"
      ],
      [
        "28 червня",
        "02:30",
        "Груповий етап",
        "ДР Конго",
        "Узбекистан"
      ],
      [
        "1 липня",
        "19:00",
        "1/16 фіналу",
        "1L",
        "3E/3H/3I/3J/3K",
        "r32-12"
      ],
      [
        "7 липня",
        "19:00",
        "1/8 фіналу",
        "Переможець матчу 86",
        "Переможець матчу 88",
        "r16-7"
      ],
      [
        "15 липня",
        "22:00",
        "Півфінал",
        "Переможець матчу 99",
        "Переможець матчу 100",
        "sf-2"
      ]
    ],
    "imagePath": "/stadiums/Mercedes-Benz Stadium.png",
    "coordinates": {
      "lat": 33.755371,
      "lng": -84.401436
    }
  },
  {
    "id": "sofi-stadium",
    "country": "США",
    "region": "Каліфорнія",
    "city": "Інглвуд / Лос-Анджелес",
    "name": "SoFi Stadium",
    "capacity": 69650,
    "matches": [
      [
        "13 червня",
        "04:00",
        "Груповий етап",
        "США",
        "Парагвай"
      ],
      [
        "16 червня",
        "04:00",
        "Груповий етап",
        "Іран",
        "Нова Зеландія"
      ],
      [
        "18 червня",
        "22:00",
        "Груповий етап",
        "Швейцарія",
        "Боснія і Герцеговина"
      ],
      [
        "21 червня",
        "22:00",
        "Груповий етап",
        "Бельгія",
        "Іран"
      ],
      [
        "26 червня",
        "05:00",
        "Груповий етап",
        "Туреччина",
        "США"
      ],
      [
        "28 червня",
        "22:00",
        "1/16 фіналу",
        "2A",
        "2B",
        "r32-3"
      ],
      [
        "2 липня",
        "22:00",
        "1/16 фіналу",
        "1H",
        "2J",
        "r32-6"
      ],
      [
        "10 липня",
        "22:00",
        "Чвертьфінал",
        "Переможець матчу 93",
        "Переможець матчу 94",
        "qf-2"
      ]
    ],
    "imagePath": "/stadiums/SoFi Stadium.png",
    "coordinates": {
      "lat": 33.953438,
      "lng": -118.339447
    }
  },
  {
    "id": "metlife-stadium",
    "country": "США",
    "region": "Нью-Джерсі",
    "city": "Іст-Ратерфорд / Нью-Йорк-Нью-Джерсі",
    "name": "MetLife Stadium",
    "capacity": 78576,
    "matches": [
      [
        "14 червня",
        "01:00",
        "Груповий етап",
        "Бразилія",
        "Марокко"
      ],
      [
        "16 червня",
        "22:00",
        "Груповий етап",
        "Франція",
        "Сенегал"
      ],
      [
        "23 червня",
        "03:00",
        "Груповий етап",
        "Норвегія",
        "Сенегал"
      ],
      [
        "25 червня",
        "23:00",
        "Груповий етап",
        "Еквадор",
        "Німеччина"
      ],
      [
        "28 червня",
        "00:00",
        "Груповий етап",
        "Панама",
        "Англія"
      ],
      [
        "1 липня",
        "00:00",
        "1/16 фіналу",
        "1I",
        "3C/3D/3F/3G/3H",
        "r32-2"
      ],
      [
        "5 липня",
        "23:00",
        "1/8 фіналу",
        "Переможець матчу 76",
        "Переможець матчу 78",
        "r16-5"
      ],
      [
        "19 липня",
        "22:00",
        "Фінал",
        "Переможець матчу 101",
        "Переможець матчу 102",
        "final-1"
      ]
    ],
    "imagePath": "/stadiums/MetLife Stadium.png",
    "coordinates": {
      "lat": 40.813477,
      "lng": -74.074951
    }
  },
  {
    "id": "gillette-stadium",
    "country": "США",
    "region": "Массачусетс",
    "city": "Фоксборо / Бостон",
    "name": "Gillette Stadium",
    "capacity": 63815,
    "matches": [
      [
        "14 червня",
        "04:00",
        "Груповий етап",
        "Гаїті",
        "Шотландія"
      ],
      [
        "17 червня",
        "01:00",
        "Груповий етап",
        "Ірак",
        "Норвегія"
      ],
      [
        "20 червня",
        "01:00",
        "Груповий етап",
        "Шотландія",
        "Марокко"
      ],
      [
        "23 червня",
        "23:00",
        "Груповий етап",
        "Англія",
        "Гана"
      ],
      [
        "26 червня",
        "22:00",
        "Груповий етап",
        "Норвегія",
        "Франція"
      ],
      [
        "29 червня",
        "23:30",
        "1/16 фіналу",
        "1E",
        "3A/3B/3C/3D/3F",
        "r32-1"
      ],
      [
        "9 липня",
        "23:00",
        "Чвертьфінал",
        "Переможець матчу 89",
        "Переможець матчу 90",
        "qf-1"
      ]
    ],
    "imagePath": "/stadiums/Gillette Stadium.png",
    "coordinates": {
      "lat": 42.09079,
      "lng": -71.264404
    }
  },
  {
    "id": "nrg-stadium",
    "country": "США",
    "region": "Техас",
    "city": "Х'юстон",
    "name": "NRG Stadium",
    "capacity": 68311,
    "matches": [
      [
        "14 червня",
        "20:00",
        "Груповий етап",
        "Німеччина",
        "Кюрасао"
      ],
      [
        "17 червня",
        "20:00",
        "Груповий етап",
        "Португалія",
        "ДР Конго"
      ],
      [
        "20 червня",
        "20:00",
        "Груповий етап",
        "Нідерланди",
        "Швеція"
      ],
      [
        "23 червня",
        "20:00",
        "Груповий етап",
        "Португалія",
        "Узбекистан"
      ],
      [
        "27 червня",
        "03:00",
        "Груповий етап",
        "Кабо-Верде",
        "Саудівська Аравія"
      ],
      [
        "29 червня",
        "20:00",
        "1/16 фіналу",
        "1C",
        "2F",
        "r32-9"
      ],
      [
        "4 липня",
        "20:00",
        "1/8 фіналу",
        "Переможець матчу 73",
        "Переможець матчу 75",
        "r16-2"
      ]
    ],
    "imagePath": "/stadiums/NRG Stadium.png",
    "coordinates": {
      "lat": 29.684702,
      "lng": -95.410965
    }
  },
  {
    "id": "hard-rock-stadium",
    "country": "США",
    "region": "Флорида",
    "city": "Маямі-Гарденс / Маямі",
    "name": "Hard Rock Stadium",
    "capacity": 64091,
    "matches": [
      [
        "16 червня",
        "01:00",
        "Груповий етап",
        "Саудівська Аравія",
        "Уругвай"
      ],
      [
        "22 червня",
        "01:00",
        "Груповий етап",
        "Уругвай",
        "Кабо-Верде"
      ],
      [
        "25 червня",
        "01:00",
        "Груповий етап",
        "Шотландія",
        "Бразилія"
      ],
      [
        "28 червня",
        "02:30",
        "Груповий етап",
        "Колумбія",
        "Португалія"
      ],
      [
        "4 липня",
        "01:00",
        "1/16 фіналу",
        "1J",
        "2H",
        "r32-13"
      ],
      [
        "12 липня",
        "00:00",
        "Чвертьфінал",
        "Переможець матчу 91",
        "Переможець матчу 92",
        "qf-3"
      ],
      [
        "19 липня",
        "00:00",
        "Матч за 3-тє місце",
        "Переможений матчу 101",
        "Переможений матчу 102",
        "third-1"
      ]
    ],
    "imagePath": "/stadiums/Hard Rock Stadium.png",
    "coordinates": {
      "lat": 25.95783,
      "lng": -80.239326
    }
  },
  {
    "id": "arrowhead-stadium",
    "country": "США",
    "region": "Міссурі",
    "city": "Канзас-Сіті",
    "name": "Arrowhead Stadium",
    "capacity": 67513,
    "matches": [
      [
        "17 червня",
        "04:00",
        "Груповий етап",
        "Аргентина",
        "Алжир"
      ],
      [
        "21 червня",
        "03:00",
        "Груповий етап",
        "Еквадор",
        "Кюрасао"
      ],
      [
        "26 червня",
        "02:00",
        "Груповий етап",
        "Туніс",
        "Нідерланди"
      ],
      [
        "28 червня",
        "05:00",
        "Груповий етап",
        "Алжир",
        "Австрія"
      ],
      [
        "4 липня",
        "04:30",
        "1/16 фіналу",
        "1K",
        "3D/3E/3I/3J/3L",
        "r32-16"
      ],
      [
        "12 липня",
        "04:00",
        "Чвертьфінал",
        "Переможець матчу 95",
        "Переможець матчу 96",
        "qf-4"
      ]
    ],
    "imagePath": "/stadiums/Arrowhead Stadium.png",
    "coordinates": {
      "lat": 39.048855,
      "lng": -94.484474
    }
  },
  {
    "id": "lincoln-financial-field",
    "country": "США",
    "region": "Пенсильванія",
    "city": "Філадельфія",
    "name": "Lincoln Financial Field",
    "capacity": 65827,
    "matches": [
      [
        "15 червня",
        "02:00",
        "Груповий етап",
        "Кот-д’Івуар",
        "Еквадор"
      ],
      [
        "20 червня",
        "04:00",
        "Груповий етап",
        "Бразилія",
        "Гаїті"
      ],
      [
        "23 червня",
        "00:00",
        "Груповий етап",
        "Франція",
        "Ірак"
      ],
      [
        "25 червня",
        "23:00",
        "Груповий етап",
        "Кюрасао",
        "Кот-д’Івуар"
      ],
      [
        "28 червня",
        "00:00",
        "Груповий етап",
        "Хорватія",
        "Гана"
      ],
      [
        "5 липня",
        "00:00",
        "1/8 фіналу",
        "Переможець матчу 74",
        "Переможець матчу 77",
        "r16-1"
      ]
    ],
    "imagePath": "/stadiums/Lincoln Financial Field.png",
    "coordinates": {
      "lat": 39.901325,
      "lng": -75.167862
    }
  },
  {
    "id": "levis-stadium",
    "country": "США",
    "region": "Каліфорнія",
    "city": "Санта-Клара / Сан-Франциско",
    "name": "Levi's Stadium",
    "capacity": 69391,
    "matches": [
      [
        "13 червня",
        "22:00",
        "Груповий етап",
        "Катар",
        "Швейцарія"
      ],
      [
        "17 червня",
        "07:00",
        "Груповий етап",
        "Австрія",
        "Йорданія"
      ],
      [
        "20 червня",
        "06:00",
        "Груповий етап",
        "Туреччина",
        "Парагвай"
      ],
      [
        "23 червня",
        "06:00",
        "Груповий етап",
        "Йорданія",
        "Алжир"
      ],
      [
        "26 червня",
        "05:00",
        "Груповий етап",
        "Парагвай",
        "Австралія"
      ],
      [
        "2 липня",
        "03:00",
        "1/16 фіналу",
        "1D",
        "3B/3E/3F/3I/3J",
        "r32-7"
      ]
    ],
    "imagePath": "/stadiums/Levi's Stadium.png",
    "coordinates": {
      "lat": 37.403297,
      "lng": -121.969765
    }
  },
  {
    "id": "lumen-field",
    "country": "США",
    "region": "Вашингтон",
    "city": "Сіетл",
    "name": "Lumen Field",
    "capacity": 65123,
    "matches": [
      [
        "15 червня",
        "22:00",
        "Груповий етап",
        "Бельгія",
        "Єгипет"
      ],
      [
        "19 червня",
        "22:00",
        "Груповий етап",
        "США",
        "Австралія"
      ],
      [
        "24 червня",
        "22:00",
        "Груповий етап",
        "Боснія і Герцеговина",
        "Катар"
      ],
      [
        "27 червня",
        "06:00",
        "Груповий етап",
        "Єгипет",
        "Іран"
      ],
      [
        "1 липня",
        "23:00",
        "1/16 фіналу",
        "1G",
        "3A/3E/3H/3I/3J",
        "r32-8"
      ],
      [
        "7 липня",
        "03:00",
        "1/8 фіналу",
        "Переможець матчу 81",
        "Переможець матчу 82",
        "r16-4"
      ]
    ],
    "imagePath": "/stadiums/Lumen Field.png",
    "coordinates": {
      "lat": 47.595135,
      "lng": -122.331917
    }
  },
  {
    "id": "bc-place",
    "country": "Канада",
    "region": "Британська Колумбія",
    "city": "Ванкувер",
    "name": "BC Place",
    "capacity": 48821,
    "matches": [
      [
        "13 червня",
        "07:00",
        "Груповий етап",
        "Австралія",
        "Туреччина"
      ],
      [
        "19 червня",
        "01:00",
        "Груповий етап",
        "Канада",
        "Катар"
      ],
      [
        "22 червня",
        "04:00",
        "Груповий етап",
        "Нова Зеландія",
        "Єгипет"
      ],
      [
        "24 червня",
        "22:00",
        "Груповий етап",
        "Швейцарія",
        "Канада"
      ],
      [
        "27 червня",
        "06:00",
        "Груповий етап",
        "Нова Зеландія",
        "Бельгія"
      ],
      [
        "3 липня",
        "06:00",
        "1/16 фіналу",
        "1B",
        "3E/3F/3G/3I/3J",
        "r32-15"
      ],
      [
        "7 липня",
        "23:00",
        "1/8 фіналу",
        "Переможець матчу 85",
        "Переможець матчу 87",
        "r16-8"
      ]
    ],
    "imagePath": "/stadiums/BC Place.png",
    "coordinates": {
      "lat": 49.276646,
      "lng": -123.112564
    }
  },
  {
    "id": "bmo-field",
    "country": "Канада",
    "region": "Онтаріо",
    "city": "Торонто",
    "name": "BMO Field",
    "capacity": 44315,
    "matches": [
      [
        "12 червня",
        "22:00",
        "Груповий етап",
        "Канада",
        "Боснія і Герцеговина"
      ],
      [
        "18 червня",
        "02:00",
        "Груповий етап",
        "Гана",
        "Панама"
      ],
      [
        "20 червня",
        "23:00",
        "Груповий етап",
        "Німеччина",
        "Кот-д’Івуар"
      ],
      [
        "24 червня",
        "02:00",
        "Груповий етап",
        "Панама",
        "Хорватія"
      ],
      [
        "26 червня",
        "22:00",
        "Груповий етап",
        "Сенегал",
        "Ірак"
      ],
      [
        "3 липня",
        "02:00",
        "1/16 фіналу",
        "2K",
        "2L",
        "r32-5"
      ]
    ],
    "imagePath": "/stadiums/BMO Field.png",
    "coordinates": {
      "lat": 43.633087,
      "lng": -79.418961
    }
  },
  {
    "id": "estadio-azteca",
    "country": "Мексика",
    "region": "Мехіко",
    "city": "Мехіко",
    "name": "Estadio Azteca",
    "capacity": 72766,
    "matches": [
      [
        "11 червня",
        "22:00",
        "Груповий етап",
        "Мексика",
        "ПАР"
      ],
      [
        "18 червня",
        "05:00",
        "Груповий етап",
        "Узбекистан",
        "Колумбія"
      ],
      [
        "25 червня",
        "04:00",
        "Груповий етап",
        "Чехія",
        "Мексика"
      ],
      [
        "1 липня",
        "04:00",
        "1/16 фіналу",
        "1A",
        "3C/3E/3F/3H/3I",
        "r32-11"
      ],
      [
        "6 липня",
        "03:00",
        "1/8 фіналу",
        "Переможець матчу 79",
        "Переможець матчу 80",
        "r16-6"
      ]
    ],
    "imagePath": "/stadiums/Estadio Azteca.png",
    "coordinates": {
      "lat": 19.302837,
      "lng": -99.150803
    }
  },
  {
    "id": "estadio-akron",
    "country": "Мексика",
    "region": "Халіско",
    "city": "Запопан / Гвадалахара",
    "name": "Estadio Akron",
    "capacity": 44330,
    "matches": [
      [
        "12 червня",
        "05:00",
        "Груповий етап",
        "Південна Корея",
        "Чехія"
      ],
      [
        "19 червня",
        "04:00",
        "Груповий етап",
        "Мексика",
        "Південна Корея"
      ],
      [
        "24 червня",
        "05:00",
        "Груповий етап",
        "Колумбія",
        "ДР Конго"
      ],
      [
        "27 червня",
        "03:00",
        "Груповий етап",
        "Уругвай",
        "Іспанія"
      ]
    ],
    "imagePath": "/stadiums/Estadio Akron.png",
    "coordinates": {
      "lat": 20.681721,
      "lng": -103.463135
    }
  },
  {
    "id": "estadio-bbva",
    "country": "Мексика",
    "region": "Нуево-Леон",
    "city": "Гвадалупе / Монтеррей",
    "name": "Estadio BBVA",
    "capacity": 50113,
    "matches": [
      [
        "15 червня",
        "05:00",
        "Груповий етап",
        "Швеція",
        "Туніс"
      ],
      [
        "21 червня",
        "07:00",
        "Груповий етап",
        "Туніс",
        "Японія"
      ],
      [
        "25 червня",
        "04:00",
        "Груповий етап",
        "ПАР",
        "Південна Корея"
      ],
      [
        "30 червня",
        "04:00",
        "1/16 фіналу",
        "1F",
        "2C",
        "r32-4"
      ]
    ],
    "imagePath": "/stadiums/Estadio BBVA.png",
    "coordinates": {
      "lat": 25.669132,
      "lng": -100.244621
    }
  }
] as const;

export const playoffMatches = [
  {
    "id": "r32-1",
    "stage": "r32",
    "slotA": "E1",
    "slotB": "A3/B3/C3/D3/F3",
    "date": "29.06",
    "time": "23:30",
    "city": "Фоксборо",
    "matchNo": 73,
    "stadiumId": "gillette-stadium"
  },
  {
    "id": "r32-2",
    "stage": "r32",
    "slotA": "I1",
    "slotB": "C3/D3/F3/G3/H3",
    "date": "01.07",
    "time": "00:00",
    "city": "Іст-Резерфорд",
    "matchNo": 74,
    "stadiumId": "metlife-stadium"
  },
  {
    "id": "r32-3",
    "stage": "r32",
    "slotA": "A2",
    "slotB": "B2",
    "date": "28.06",
    "time": "22:00",
    "city": "Inglewood, CA",
    "matchNo": 75,
    "stadiumId": "sofi-stadium"
  },
  {
    "id": "r32-4",
    "stage": "r32",
    "slotA": "F1",
    "slotB": "C2",
    "date": "30.06",
    "time": "04:00",
    "city": "Монтерей",
    "matchNo": 76,
    "stadiumId": "estadio-bbva"
  },
  {
    "id": "r32-5",
    "stage": "r32",
    "slotA": "K2",
    "slotB": "L2",
    "date": "03.07",
    "time": "02:00",
    "city": "Торонто",
    "matchNo": 77,
    "stadiumId": "bmo-field"
  },
  {
    "id": "r32-6",
    "stage": "r32",
    "slotA": "H1",
    "slotB": "J2",
    "date": "02.07",
    "time": "22:00",
    "city": "Inglewood, CA",
    "matchNo": 78,
    "stadiumId": "sofi-stadium"
  },
  {
    "id": "r32-7",
    "stage": "r32",
    "slotA": "D1",
    "slotB": "B3/E3/F3/I3/J3",
    "date": "02.07",
    "time": "03:00",
    "city": "Санта-Клара",
    "matchNo": 79,
    "stadiumId": "levis-stadium"
  },
  {
    "id": "r32-8",
    "stage": "r32",
    "slotA": "G1",
    "slotB": "A3/E3/H3/I3/J3",
    "date": "01.07",
    "time": "23:00",
    "city": "Сіетл",
    "matchNo": 80,
    "stadiumId": "lumen-field"
  },
  {
    "id": "r32-9",
    "stage": "r32",
    "slotA": "C1",
    "slotB": "F2",
    "date": "29.06",
    "time": "20:00",
    "city": "Х'юстон",
    "matchNo": 81,
    "stadiumId": "nrg-stadium"
  },
  {
    "id": "r32-10",
    "stage": "r32",
    "slotA": "E2",
    "slotB": "I2",
    "date": "30.06",
    "time": "20:00",
    "city": "Арлінгтон",
    "matchNo": 82,
    "stadiumId": "att-stadium"
  },
  {
    "id": "r32-11",
    "stage": "r32",
    "slotA": "A1",
    "slotB": "C3/E3/F3/H3/I3",
    "date": "01.07",
    "time": "04:00",
    "city": "Мехіко",
    "matchNo": 83,
    "stadiumId": "estadio-azteca"
  },
  {
    "id": "r32-12",
    "stage": "r32",
    "slotA": "L1",
    "slotB": "E3/H3/I3/J3/K3",
    "date": "01.07",
    "time": "19:00",
    "city": "Атланта",
    "matchNo": 84,
    "stadiumId": "mercedes-benz-stadium"
  },
  {
    "id": "r32-13",
    "stage": "r32",
    "slotA": "J1",
    "slotB": "H2",
    "date": "04.07",
    "time": "01:00",
    "city": "Маямі-Гарденс",
    "matchNo": 85,
    "stadiumId": "hard-rock-stadium"
  },
  {
    "id": "r32-14",
    "stage": "r32",
    "slotA": "D2",
    "slotB": "G2",
    "date": "03.07",
    "time": "21:00",
    "city": "Арлінгтон",
    "matchNo": 86,
    "stadiumId": "att-stadium"
  },
  {
    "id": "r32-15",
    "stage": "r32",
    "slotA": "B1",
    "slotB": "E3/F3/G3/I3/J3",
    "date": "03.07",
    "time": "06:00",
    "city": "Ванкувер",
    "matchNo": 87,
    "stadiumId": "bc-place"
  },
  {
    "id": "r32-16",
    "stage": "r32",
    "slotA": "K1",
    "slotB": "D3/E3/I3/J3/L3",
    "date": "04.07",
    "time": "04:30",
    "city": "Kansas City, MO",
    "matchNo": 88,
    "stadiumId": "arrowhead-stadium"
  },
  {
    "id": "r16-1",
    "stage": "r16",
    "fromA": "r32-1",
    "fromB": "r32-2",
    "date": "05.07",
    "time": "00:00",
    "city": "Філадельфія",
    "matchNo": 89,
    "stadiumId": "lincoln-financial-field"
  },
  {
    "id": "r16-2",
    "stage": "r16",
    "fromA": "r32-3",
    "fromB": "r32-4",
    "date": "04.07",
    "time": "20:00",
    "city": "Х'юстон",
    "matchNo": 90,
    "stadiumId": "nrg-stadium"
  },
  {
    "id": "r16-3",
    "stage": "r16",
    "fromA": "r32-5",
    "fromB": "r32-6",
    "date": "06.07",
    "time": "22:00",
    "city": "Арлінгтон",
    "matchNo": 91,
    "stadiumId": "att-stadium"
  },
  {
    "id": "r16-4",
    "stage": "r16",
    "fromA": "r32-7",
    "fromB": "r32-8",
    "date": "07.07",
    "time": "03:00",
    "city": "Сіетл",
    "matchNo": 92,
    "stadiumId": "lumen-field"
  },
  {
    "id": "r16-5",
    "stage": "r16",
    "fromA": "r32-9",
    "fromB": "r32-10",
    "date": "05.07",
    "time": "23:00",
    "city": "Іст-Резерфорд",
    "matchNo": 93,
    "stadiumId": "metlife-stadium"
  },
  {
    "id": "r16-6",
    "stage": "r16",
    "fromA": "r32-11",
    "fromB": "r32-12",
    "date": "06.07",
    "time": "03:00",
    "city": "Мехіко",
    "matchNo": 94,
    "stadiumId": "estadio-azteca"
  },
  {
    "id": "r16-7",
    "stage": "r16",
    "fromA": "r32-13",
    "fromB": "r32-14",
    "date": "07.07",
    "time": "19:00",
    "city": "Атланта",
    "matchNo": 95,
    "stadiumId": "mercedes-benz-stadium"
  },
  {
    "id": "r16-8",
    "stage": "r16",
    "fromA": "r32-15",
    "fromB": "r32-16",
    "date": "07.07",
    "time": "23:00",
    "city": "Ванкувер",
    "matchNo": 96,
    "stadiumId": "bc-place"
  },
  {
    "id": "qf-1",
    "stage": "qf",
    "fromA": "r16-1",
    "fromB": "r16-2",
    "date": "09.07",
    "time": "23:00",
    "city": "Фоксборо",
    "matchNo": 97,
    "stadiumId": "gillette-stadium"
  },
  {
    "id": "qf-2",
    "stage": "qf",
    "fromA": "r16-3",
    "fromB": "r16-4",
    "date": "10.07",
    "time": "22:00",
    "city": "Inglewood, CA",
    "matchNo": 98,
    "stadiumId": "sofi-stadium"
  },
  {
    "id": "qf-3",
    "stage": "qf",
    "fromA": "r16-5",
    "fromB": "r16-6",
    "date": "12.07",
    "time": "00:00",
    "city": "Маямі-Гарденс",
    "matchNo": 99,
    "stadiumId": "hard-rock-stadium"
  },
  {
    "id": "qf-4",
    "stage": "qf",
    "fromA": "r16-7",
    "fromB": "r16-8",
    "date": "12.07",
    "time": "04:00",
    "city": "Kansas City, MO",
    "matchNo": 100,
    "stadiumId": "arrowhead-stadium"
  },
  {
    "id": "sf-1",
    "stage": "sf",
    "fromA": "qf-1",
    "fromB": "qf-2",
    "date": "14.07",
    "time": "22:00",
    "city": "Арлінгтон",
    "matchNo": 101,
    "stadiumId": "att-stadium"
  },
  {
    "id": "sf-2",
    "stage": "sf",
    "fromA": "qf-3",
    "fromB": "qf-4",
    "date": "15.07",
    "time": "22:00",
    "city": "Атланта",
    "matchNo": 102,
    "stadiumId": "mercedes-benz-stadium"
  },
  {
    "id": "third-1",
    "stage": "final",
    "fromA": "sf-1",
    "fromB": "sf-2",
    "loserMatch": true,
    "date": "19.07",
    "time": "00:00",
    "city": "Маямі-Гарденс",
    "label": "3-є місце",
    "matchNo": 103,
    "stadiumId": "hard-rock-stadium"
  },
  {
    "id": "final-1",
    "stage": "final",
    "fromA": "sf-1",
    "fromB": "sf-2",
    "date": "19.07",
    "time": "22:00",
    "city": "Іст-Резерфорд",
    "matchNo": 104,
    "stadiumId": "metlife-stadium"
  }
] as const;
